tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"

# CLI tools
brew "bat"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "lazygit"
brew "neovim"
brew "oh-my-posh", tap: "jandedobbeleer/oh-my-posh"
brew "ripgrep"
brew "sevenzip"
brew "tmux"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"

# Neovim dependencies
brew "luarocks"
brew "stylua"

# Kubernetes & containers
brew "k9s"
brew "kubernetes-cli"
brew "minikube"
brew "tilt"

# Media & preview (yazi)
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "imagemagick"
brew "poppler"
brew "vips"

# Diagrams
brew "graphviz"
brew "plantuml"

# Libraries
brew "glib"
brew "harfbuzz"
brew "icu4c@77"
brew "librsvg"
brew "open-mpi"
brew "openssl@3"
brew "utf8proc", args: ["HEAD"]
brew "zstd"

# Dock management
brew "dockutil"

# LLM tooling
brew "promptfoo"

# Apps
cask "claude-code"
cask "copilot-cli"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "rancher"
cask "rectangle"
cask "visual-studio-code"
cask "warp"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "jebbs.plantuml"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
