# CLI tools
brew "bat"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gh"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "oh-my-posh"
brew "ripgrep"
brew "sevenzip"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"

# Neovim dependencies
brew "luarocks"
brew "stylua"

# Kubernetes & containers
brew "k9s"
brew "kubernetes-cli"
brew "minikube"
brew "tilt"

# Media & preview (yazi)
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "imagemagick"
brew "poppler"
brew "vips"

# Diagrams
brew "graphviz"
brew "plantuml"

# Libraries
brew "glib"
brew "harfbuzz"
brew "icu4c@77"
brew "librsvg"
brew "open-mpi"
brew "openssl@3"
brew "utf8proc"
brew "zstd"

# Dock management
brew "dockutil"

# LLM tooling
brew "ollama"
brew "promptfoo"

# Infrastructure as code
brew "pulumi"

# Apps
cask "claude-code"
cask "ghostty"
cask "google-chrome"
cask "obsidian"
cask "rancher"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "wispr-flow"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "dbtlabsinc.dbt"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "jebbs.plantuml"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
