# AI
anthropic.claude-code

# Editor
vscodevim.vim

# Git
eamodio.gitlens

# Collaboration
ms-vsliveshare.vsliveshare

# Diagrams
jebbs.plantuml

# Data
mechatroner.rainbow-csv
ms-python.python
ms-toolsai.jupyter
innoverio.vscode-dbt-power-user

# Infrastructure
docker.docker
redhat.vscode-yaml
